{
  "nlDalzXm": {
    "id": "nlDalzXm",
    "title": "Kidogo Mobile App",
    "image": "android",
    "specs": {
      "framework": "React Native",
      "platform": "Android",
      "persistence": "Dynamo DB"
    },
    "desc": {
      "Description": "Owned discovery work with users & stakeholders, designed, developed, and delivered the Kidogo Mobile App prototype; a childcare Swiss army knife, offering digital and automated solutions for enrollment, payments, attendance, and finance tracking. The app blends Swahili, English, audio, and visual depictions to complement an intuitive, simple design ensuring usability.",
      "Architecture": "Limited funds and rapidly growing clientele necessitated an affordable, scalable solution. The Kidogo app is a serverless, offline-first React Native app. When users have access to wifi they connect to the backend, triggering a Node/Express Lambda, and persisting data through DynamoDB. Kidogo only pays for what it uses.",
      "Impact": "The prototype is currently being user tested by 30 participants across multiple childcare centers. Development continues after the rigorous onboarding I provided to new freelance developers to support continuous integration and development."
    }
  },
  "tTqqKl_i": {
    "id": "tTqqKl_i",
    "title": "Digital Directory",
    "image": "windows",
    "specs": {
      "framework": "Electron",
      "platform": "Windows",
      "persistence": "Redis",
      "units": 16
    },
    "desc": {
      "Description": "A digital kiosk that allows customers to find products, amenities, and restaurants in one of North America's top high-end retailers flagship stores.",
      "Architecture": "The Electron-based desktop app for 55-inch touchscreen display features a React app that synthesizes data from a Java product information API and caches data via Redis. Extensive metrics and analytics from Datadog, Splunk, and ClickStream provide a granular insight into exactly how users interface with the solution.",
      "Impact": "16 units across two stores have provide a delightful experience across an average of 3,000 monthly sessions per device. Cutting-edge React technology provides an exception-safe experience and a powerful insight into customer behavior provides uniquely valuable data."
    }
  }
}